(function(){
  const 吴亦凡 = {
    名字: {
      中文: '吴亦凡',
      英文:  'Kris'
    },
    身高: 187,
    自我介绍: function(){
      return `歌手${this.名字.中文}。其实我是一个演员。`;
    },
    '有 freestyle 吗？': function(){
      return ['有 freestyle 吗？', '还有 freestyle 吗？', '有没有 freestyle？'][Math.floor(Math.random() * 3)];
    }
  }
  function createArtist(name, from) {
    var bio = name + "，来自" + from;
    return {
      name,
      from,
      bio,      
      intro(){
        return "大家好！我是" + this.bio + "。";
      }
    };
  }
  var 周杰伦 = {
    专辑: {
      周杰伦: {
        发行年份: 2000,
        专辑曲目: [
          '可爱女人', '完美主义', '星晴', '娘子', '斗牛', '黑色幽默', 
          '伊斯坦堡', '印地安老斑鸠', '龙卷风', '反方向的钟'
        ],
      },
      范特西: {
        发行年份: 2001,
        专辑曲目: [
          '爱在西元前', '爸我回来了', '简单爱', '忍者', '开不了口', 
          '上海一九四三', '对不起', '威廉古堡', '双截棍', '安静'
        ]
      },
      八度空间: {
        发行年份: 2002,
        专辑曲目: [
          '半兽人', '半岛铁盒', '暗号', '龙拳', '火车叨位去',
          '分裂', '爷爷泡的茶', '回到过去', '米兰的小铁匠', '最后的战役'
        ]
      },
      叶惠美: {
        发行年份: 2003,
        专辑曲目: [
          '以父之名', '儒夫', '晴天', '三年二班', '东风破', '你听得到',
          '同一种调调', '她的睫毛', '爱情悬崖', '梯田', '双刀'
        ]
      },
      七里香: {
        发行年份: 2004,
        专辑曲目: [
          '我的地盘', '七里香', '借口', '外婆', '将军',
          '搁浅', '乱舞春秋', '困兽之斗', '园游会', '止战之殇'
        ]
      },
      十一月的萧邦: {
        发行年份: 2005,
        专辑曲目: [
          '夜曲', '蓝色风暴', '发如雪', '黑色毛衣', '四面楚歌', '枫', 
          '浪漫手机', '逆鳞', '麦芽糖', '珊瑚海', '漂移', '一路向北'
        ]
      },
      依然范特西: {
        发行年份: 2006,
        专辑曲目: [
          '夜的第七章', '听妈妈的话', '千里之外', '本草纲目', '退后',
          '红模仿', '心雨', '白色风车', '迷迭香', '菊花台'
        ]
      },
      我很忙: {
        发行年份: 2007,
        专辑曲目: [
          '牛仔很忙', '彩虹', '青花瓷', '阳光宅男', '蒲公英的约定',
          '无双', '我不配', '扯', '甜甜的', '最长的电影'
        ]
      },
      魔杰座: {
        发行年份: 2008,
        专辑曲目: [
          '龙战骑士', '给我一首歌的时间', '蛇舞', '花海', '魔术先生',
          '说好的幸福呢', '兰亭序', '流浪诗人', '时光机', '乔克叔叔', '稻香'
        ]
      },
      跨時代: {
        发行年份: 2010,
        专辑曲目: [
          '跨时代', '说了再见', '烟花易冷', '免费教学录影带', '好久不见', '雨下一整晚',
          '嘻哈空姐', '我落泪·情绪零碎', '爱的飞行日记', '自导自演', '超人不会飞'
        ]
      },
      惊叹号: {
        发行年份: 2011,
        专辑曲目: [
          '惊叹号', '迷魂曲', 'Mine Mine', '公主病', '你好吗', '疗伤烧肉粽',
          '琴伤', '水手怕水', '世界未末日', '皮影戏', '超跑女神'
        ]
      },
      十二新作: {
        发行年份: 2012,
        专辑曲目: [
          '四季列车', '手语', '公公偏头痛', '明明就', '傻笑', '比较大的大提琴',
          '爱你没差', '红尘客栈', '梦想启动', '大笨钟', '哪里都是你', '乌克丽丽'
        ]
      },
      "哎呦，不错哦": {
        发行年份: 2014,
        专辑曲目: [
          '阳明山', '窃爱', '算什么男人', '天涯过客', '怎么了', '一口气全念对',
          '我要夏天', '手写的从前', '鞋子特大号', '听爸爸的話', '美人鱼', '听见下雨的声音'
        ]
      },
      周杰伦的床边故事: {
        发行年份: 2016,
        专辑曲目: [
          '床边故事', '说走就走', '一点点', '前世情人', '英雄', '不该',
          '土耳其冰激凌', '告白气球', 'Now you See me', '爱情废柴'
        ]
      },
      列表: function(){
        for (var i in 周杰伦.专辑) {
          if (typeof 周杰伦.专辑[i] !== 'function') {
            周杰伦.专辑[i].专辑名称 = i;
          }
        }
        return (function(){
                  var result = Object.keys(周杰伦.专辑);
                  result.pop();
                  return result;
                })()        
      }
    }
  };
  function 输出周杰伦专辑(){
    var 周杰伦string = '';
    for (var i in 周杰伦.专辑) {
      if (typeof 周杰伦.专辑[i] !== 'function') {
        周杰伦string += (i + ',');
      }
    }
    周杰伦专辑字符串 = 周杰伦string.replace(/,(?![\S+])/g,'。');
    document.write('周杰伦的所有专辑名称有：'+周杰伦专辑字符串+'<br><br>')
  }
  document.write(吴亦凡.自我介绍()+'<br><br>');
  document.write('我的英文名是：'+吴亦凡.名字.英文+'<br><br>');
  document.write(吴亦凡.名字.英文+':'+吴亦凡['有 freestyle 吗？']()+'<br><br>');
  document.write(createArtist('凌','徐州').intro()+'<br><br>');
  输出周杰伦专辑();
  document.write('周杰伦专辑名称数组：'+周杰伦.专辑.列表());

  function bigShowPic(){
    var pics = document.querySelectorAll('div > img');
    for (var i = pics.length - 1; i >= 0; i--) {
      (function(i){
        pics[i].addEventListener('click',function(){
          var tdiv = document.createElement('section');
          tdiv.classList.add('bg-gray');
          tdiv.innerHTML = '<img src="images/code-pic'+(Number(i)+1)+'.jpg">';
          tdiv.addEventListener('click',function(e){
            if (e.target.nodeName === 'SECTION') {
              document.body.removeChild(this);
            }
          })
          document.body.appendChild(tdiv);
        })
      })(i)
    }
  }
  bigShowPic();
})()